# 在控制台中打印如下图形
# *****
# *****
# *****
# *****
# *****

# 创建一个循环来控制图形的高度
# 循环嵌套时，外层循环每执行一次，内层循环就要执行一圈
# i = 0
#
# while i < 5 :
#     # 创建一个内层循环来控制图形的宽度
#     j = 0
#     while j < 5:
#         print('* ',end = '')
#         j += 1
#     print()
#     i += 1

# *
# **
# ***
# ****
# *****
# i = 0
#
# while i < 5 :
#     # 创建一个内层循环来控制图形的宽度
#     j = 0
#     while j < i + 1:
#         print('* ',end = '')
#         j += 1
#     print()
#     i += 1


# *****
# ****
# ***
# **
# *
i = 0

while i < 5 :
    # 创建一个内层循环来控制图形的宽度
    j = 0
    while j < 5 - i:
        print('* ',end = '')
        j += 1
    print()
    i += 1


## 循环嵌套
# 练习1
#     打印99乘法表
#     1*1=1
#     1*2=2 2*2=4
#     1*3=3 2*3=6 3*3=9
#     …………                        9*9=81

# 练习2
#     求100以内所有的质数